trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/ПеремещениеТоваровПоЭтапам/ПеремещениеТоваровПоЭтапам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b789d9c8-9c7e-4b46-8845-6246cc959c46">
  <name>ПеремещениеТоваровПоЭтапам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="27901d9b-0677-4e0a-b894-7fb88c9e7c8c">
    <name>НачалоЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="655ed39c-aceb-45c7-a840-288dfa10f2a7">
    <name>ОкончаниеЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="1d917816-8ff7-4c74-8c21-4eafceb0960c">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="51f6dfd7-0717-49c6-83cb-c92fe66feed7">
    <name>ЭтапПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/CommonForms/ПроверкаЗаполненияДокументов/Module.bsl
&НаКлиенте
Процедура Док_ОбработкаОповещенияВместо(ИмяСобытия, Параметр, Источник)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КэшированныеЗначения",    КэшированныеЗначения);
	ДополнительныеПараметры.Вставить("СтандартнаяОбработка",    Истина);
	ДополнительныеПараметры.Вставить("ТребуетсяСерверныйВызов", Ложь);
	СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
	КэшированныеЗначения = ДополнительныеПараметры.КэшированныеЗначения;
	Если ДополнительныеПараметры.ТребуетсяСерверныйВызов Тогда
		ОбработкаОповещенияНаСервере(ИмяСобытия, Параметр, Источник);
	КонецЕсли;
	Если Не ДополнительныеПараметры.СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			
			ДанныеШтрихкодов = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			ОбработатьШтрихкоды(ДанныеШтрихкодов);
			
			//+Альтерра
			Если ПроверкаПеремещения Тогда
				ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
				Если ТекущиеДанные <> Неопределено Тогда
					ТекущиеДанные.СпособВводаКоличества = ПредопределенноеЗначение("Перечисление.СпособыВводаКоличестваТовара.Сканер");
					ТекущиеДанные.Отсканирован = Истина;
				КонецЕсли;
			КонецЕсли;
			//-	
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// Неизвестные штрихкоды
	Если Источник = "ПодключаемоеОборудование"
		И ИмяСобытия = "НеизвестныеШтрихкоды"
		И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
		
		КэшированныеЗначения.Штрихкоды.Очистить();
		ДанныеШтрихкодов = Новый Массив;
		Для Каждого ПолученныйШтрихкод Из Параметр.ПолученыНовыеШтрихкоды Цикл
			ДанныеШтрихкодов.Добавить(ПолученныйШтрихкод);
		КонецЦикла;
		Для Каждого ПолученныйШтрихкод Из Параметр.ЗарегистрированныеШтрихкоды Цикл
			ДанныеШтрихкодов.Добавить(ПолученныйШтрихкод);
		КонецЦикла;
		
		ОбработатьШтрихкоды(ДанныеШтрихкодов);
		
		//+ Альтерра
		Если ПроверкаПеремещения Тогда
			ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
			Если ТекущиеДанные <> Неопределено Тогда
				ТекущиеДанные.СпособВводаКоличества = ПредопределенноеЗначение("Перечисление.СпособыВводаКоличестваТовара.Сканер");
				ТекущиеДанные.Отсканирован = Истина;
			КонецЕсли;
		КонецЕсли;
		//-
	КонецЕсли;
		
КонецПроцедуры

#Область ПроверкаПеремещений

&НаСервере
Функция СкладПересорта(ссылка)
	если типзнч(ссылка)<>тип("ДокументСсылка.ПеремещениеТоваров") тогда
		возврат Неопределено;
	конецесли;	

	 Возврат Ссылка.СкладОтправитель;
КонецФункции 

&НаСервере
Функция ЗаполнитьТаблицу(ТоварыНедостачи,ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВР_Табл
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
		|	СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК ВНаличии
		|ПОМЕСТИТЬ втРаспределениеЗапасов
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки(
		|			,
		|			Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|				И Склад = &Склад) КАК ЗапасыИПотребностиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыИПотребностиОстатки.Номенклатура,
		|	ЗапасыИПотребностиОстатки.Характеристика
		| ;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_Табл.Номенклатура КАК Номенклатура,
		|	ВР_Табл.Характеристика КАК Характеристика,
		|	ВР_Табл.КоличествоУпаковок КАК Количество,
		|	ВР_Табл.КоличествоУпаковок КАК КоличествоУпаковок
		|ИЗ
		|	ВР_Табл КАК ВР_Табл
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРаспределениеЗапасов КАК втРаспределениеЗапасов
		|		ПО ВР_Табл.Номенклатура = втРаспределениеЗапасов.Номенклатура
		|			И ВР_Табл.Характеристика = втРаспределениеЗапасов.Характеристика
		|ГДЕ
		|	ВР_Табл.КоличествоУпаковок <= ЕСТЬNULL(втРаспределениеЗапасов.ВНаличии, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_Табл.Номенклатура КАК Номенклатура,
		|	ВР_Табл.Характеристика КАК Характеристика,
		|	ВР_Табл.КоличествоУпаковок КАК Количество,
		|	ВР_Табл.КоличествоУпаковок КАК КоличествоУпаковок
		|ИЗ
		|	ВР_Табл КАК ВР_Табл
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРаспределениеЗапасов КАК втРаспределениеЗапасов
		|		ПО ВР_Табл.Номенклатура = втРаспределениеЗапасов.Номенклатура
		|			И ВР_Табл.Характеристика = втРаспределениеЗапасов.Характеристика
		|ГДЕ
		|	ВР_Табл.КоличествоУпаковок > ЕСТЬNULL(втРаспределениеЗапасов.ВНаличии, 0)";

	
	Запрос.УстановитьПараметр("Товары", ТоварыНедостачи.Выгрузить());
	Запрос.УстановитьПараметр("Склад", ссылка.СкладОтправитель);
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

&НаКлиенте
Процедура Док_ЗавершитьПроверкуВместо(Команда)
			
	ОбработкаЗакрытия = Ложь;
	
	ТоварыОтвязаноОтНабора.Очистить();
	
	АнализНаборов();
	
	ОчиститьСообщения();
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	МассивСтрокНовыеТовары = Новый Массив;
	МассивСтрокНедостачи   = Новый Массив;
	МассивСтрокИзлишки     = Новый Массив;
	Для Каждого СтрокаТЧ Из Товары Цикл
		Если СтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковокФактИтог Тогда
			// Нет расхождений
		ИначеЕсли СтрокаТЧ.КоличествоУпаковок = 0 И СтрокаТЧ.КоличествоУпаковокФактИтог > 0 Тогда
			// Новый товар
			МассивСтрокНовыеТовары.Добавить(СтрокаТЧ);
			
		ИначеЕсли СтрокаТЧ.КоличествоУпаковок > СтрокаТЧ.КоличествоУпаковокФактИтог Тогда
			// Недостача
			МассивСтрокНедостачи.Добавить(СтрокаТЧ);
			
		ИначеЕсли СтрокаТЧ.КоличествоУпаковок < СтрокаТЧ.КоличествоУпаковокФактИтог Тогда
			// Излишек
			МассивСтрокИзлишки.Добавить(СтрокаТЧ);
			
		КонецЕсли;
	КонецЦикла;
	
	РазрешеноЗавершитьПроверку = Истина;
	Если    МассивСтрокНовыеТовары.Количество() > 0
		ИЛИ МассивСтрокНедостачи.Количество()   > 0
		ИЛИ МассивСтрокИзлишки.Количество()     > 0
		ИЛИ ТоварыОтвязаноОтНабора.Количество() > 0 Тогда
		
		Если ОтклонениеЗапрещено Тогда
			РазрешеноЗавершитьПроверку = Ложь;
		КонецЕсли;
		
		СписокВопросов = Новый СписокЗначений();
		СписокВопросов.Добавить("Перенести", НСтр("ru = 'Перенести'"));
		СписокВопросов.Добавить("НеПереносить", НСтр("ru = 'Не переносить'"));
		СписокВопросов.Добавить("ВернутьсяКПроверке", НСтр("ru = 'Вернуться к проверке'"));
		
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ОбработкаОтветаНаВопрос",
		                                                    ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Обнаружены расхождения между количеством товаров в документе и результатом проверки. 
									|Перенести фактические данные в документ?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, СписокВопросов);

	Иначе
		
		ОбработкаЗакрытия = Истина;
		
		ДополнительныеПараметры = Новый Структура("ТребуетсяСерверныйВызов, РезультатЗакрытия", Ложь, Неопределено);
		СобытияФормКлиент.ПриИзмененииЭлемента(ЭтотОбъект, "РезультатЗакрытия", ДополнительныеПараметры);
		Если ДополнительныеПараметры.ТребуетсяСерверныйВызов Тогда
			ПолучитьРезультатЗакрытияНаСервере(ДополнительныеПараметры);
		КонецЕсли;
		
		//+ Альтерра	
		Если ПроверкаПеремещения Тогда
			Закрыть(БезРасхожденийЗакончитьПроверку(Товары));
		Иначе
			Закрыть(ДополнительныеПараметры.РезультатЗакрытия);
		КонецЕсли;	
		//-
		
	КонецЕсли;
	
	//+ Альтерра	
	Если ОбработкаЗакрытия Тогда
		УдалитьТЧВХранилищеНастроек();
	КонецЕсли;
	//-
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция БезРасхожденийЗакончитьПроверку(Знач Товары)
	
	ТаблицаТовары = Товары.Выгрузить();
	ТаблицаТовары.Колонки.Добавить("БезРасхождений", Новый ОписаниеТипов("Булево")); 
	ТаблицаТовары.ЗаполнитьЗначения(Истина, "БезРасхождений"); 
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(ТаблицаТовары);
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Товары", АдресВХранилище);
	
	Возврат ПараметрыЗакрытия;	
	
КонецФункции


&НаСервереБезКонтекста
Процедура ЗафиксироватьДанныеЭтапаПриемки(Ссылка, ВремяНачалаПриемки)
	
	ТекущийЭтап = Перечисления.ЭтапыПеремещения.Приемка;
	НаборЗаписей = РегистрыСведений.ПеремещениеТоваровПоЭтапам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Отбор.ЭтапПеремещения.Установить(ТекущийЭтап);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество()= 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Документ = Ссылка;
		Запись.ЭтапПеремещения = ТекущийЭтап;
		Запись.НачалоЭтапа = ВремяНачалаПриемки;
	ИначеЕсли НаборЗаписей[0].ОкончаниеЭтапа = '00010101' Тогда
		Запись = НаборЗаписей[0];
		Запись.НачалоЭтапа = ВремяНачалаПриемки;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры 

&Вместо("ЗакончитьПроверкуНаСервере")
Функция Док_ЗакончитьПроверкуНаСервере()
	
	// Создаем пустую таблицу Товаров
	ТаблицаТовары = ТоварыОтвязаноОтНабора.Выгрузить(Новый Структура("Номенклатура", Справочники.Номенклатура.ПустаяСсылка())).СкопироватьКолонки();
	
	//+ Альтерра 
	Если ПеремещениеПоЗаказам Тогда
		ТаблицаТовары.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	КонецЕсли;   
	
	Если ПроверкаПеремещения Тогда
		ТаблицаТовары.Колонки.Добавить("БезРасхождений", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	//-
	
	МассивСтрокНовыеТовары = Новый Массив;
	МассивСтрокНедостачи   = Новый Массив;
	МассивСтрокИзлишки     = Новый Массив;
	
	Для Каждого СтрокаТЧ Из ТоварыОтвязаноОтНабора Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ,,"КоличествоУпаковок,НоменклатураНабора, ХарактеристикаНабора, ИндексНабора");
		НоваяСтрока.КоличествоУпаковокФакт = СтрокаТЧ.КоличествоУпаковок;
		НоваяСтрока.КоличествоУпаковокФактИтог = СтрокаТЧ.КоличествоУпаковок;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		
		Если СтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковокФактИтог Тогда
			// Нет расхождений  
			//+ Альтерра
			Если ПроверкаПеремещения Тогда
				НоваяСтрока = ТаблицаТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				НоваяСтрока.БезРасхождений = Истина;
			КонецЕсли;
            //-
		ИначеЕсли СтрокаТЧ.КоличествоУпаковок = 0 И СтрокаТЧ.КоличествоУпаковокФактИтог > 0 Тогда
			// Новый товар
			МассивСтрокНовыеТовары.Добавить(СтрокаТЧ);
		ИначеЕсли СтрокаТЧ.КоличествоУпаковок > СтрокаТЧ.КоличествоУпаковокФактИтог Тогда
			// Недостача
			МассивСтрокНедостачи.Добавить(СтрокаТЧ);
		ИначеЕсли СтрокаТЧ.КоличествоУпаковок < СтрокаТЧ.КоличествоУпаковокФактИтог Тогда
			// Излишек
			МассивСтрокИзлишки.Добавить(СтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПревышениеКоличестваТоваровРазрешено Тогда
		Для Каждого СтрокаТЧ Из МассивСтрокНовыеТовары Цикл
			НоваяСтрока = ТаблицаТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, , "КоличествоУпаковок");
			НоваяСтрока.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковокФактИтог - СтрокаТЧ.КоличествоУпаковок;
		КонецЦикла;
		Для Каждого СтрокаТЧ Из МассивСтрокИзлишки Цикл
			НоваяСтрока = ТаблицаТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, , "КоличествоУпаковок");
			НоваяСтрока.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковокФактИтог - СтрокаТЧ.КоличествоУпаковок;
		КонецЦикла;
	КонецЕсли;
	Для Каждого СтрокаТЧ Из МассивСтрокНедостачи Цикл
		НоваяСтрока = ТаблицаТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, , "КоличествоУпаковок");
		НоваяСтрока.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковокФактИтог - СтрокаТЧ.КоличествоУпаковок;
	КонецЦикла; 
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ТаблицаТовары, АдресВоВременномХранилище);
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Товары",        АдресВоВременномХранилище);
	
	СобытияФорм.ПриИзмененииЭлемента(ЭтотОбъект, "ЗавершитьПроверку", ПараметрыЗакрытия);
	
	Возврат ПараметрыЗакрытия;
	
КонецФункции
#КонецОбласти

#Область ПечатьЭтикетокИЦенников

&НаКлиенте
Процедура Док__ПечатьЭтикетокПоРасхождениямПосле(Команда)
	
	ДополнительныеПараметры = Новый Структура("МенеджерПечати", "Документ.ПеремещениеТоваров");
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Ссылка);
	
	АдресВХранилище =
	ДанныеДляПечатиЭтикеток(МассивОбъектов);
	
	ОткрытьФорму(
	"Обработка.ПечатьЭтикетокИЦенников.Форма.ФормаТовары",
	Новый Структура("АдресВХранилище, НазначениеШаблона", АдресВХранилище, Неопределено),
	ЭтаФорма,
	Новый УникальныйИдентификатор);
	
КонецПроцедуры

// Функция помещает необходимые данные в структуру. Структура помещается во временное хранилище.
//
// Возвращаемое значение:
//   Адрес   - адрес структуры данных во временном хранилище
//
// Функция помещает необходимые данные в структуру. Структура помещается во временное хранилище.
//
// Возвращаемое значение:
//   Адрес   - адрес структуры данных во временном хранилище
//
Функция ДанныеДляПечатиЭтикеток(МассивДокументов) Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТЗ.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТЗ.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Ном = 1;
	
	Для Каждого Товар Из Товары Цикл
		Расхождение = Цел(Товар.КоличествоУпаковок-Товар.КоличествоУпаковокФакт);
		Если Расхождение <> 0 Тогда 
			НоваяСтрока = ТЗ.Добавить();
			НоваяСтрока.Номенклатура = Товар.Номенклатура;
			НоваяСтрока.Характеристика = Товар.Характеристика;
			НоваяСтрока.Упаковка = Товар.Упаковка;
			НоваяСтрока.Порядок = Ном;
			НоваяСтрока.Количество = Расхождение;
			Ном = Ном + 1;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПеремещениеТоваров.Организация                      КАК Организация,
	|	ПеремещениеТоваров.СкладПолучатель                  КАК Склад,
	|	ПеремещениеТоваров.СкладПолучатель.РозничныйВидЦены КАК ВидЦены
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров 
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаРеквизитыДокументов = МассивРезультатов[0].Выгрузить();
	МассивОрганизаций = ОбщегоНазначенияУТ.УникальныеЗначенияИзКолонкиТаблицы(ТаблицаРеквизитыДокументов, "Организация");
	МассивСкладов     = ОбщегоНазначенияУТ.УникальныеЗначенияИзКолонкиТаблицы(ТаблицаРеквизитыДокументов, "Склад");
	МассивВидовЦен    = ОбщегоНазначенияУТ.УникальныеЗначенияИзКолонкиТаблицы(ТаблицаРеквизитыДокументов, "ВидЦены");
	
	// Подготовка структуры действий для обработки печати ценников и этикеток
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьОрганизацию", ?(МассивОрганизаций.Количество() = 1, МассивОрганизаций[0], Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьСклад",       ?(МассивСкладов.Количество() = 1,     МассивСкладов[0],     МассивСкладов));
	СтруктураДействий.Вставить("ЗаполнитьВидЦены",     ?(МассивВидовЦен.Количество() = 1,    МассивВидовЦен[0],    Неопределено));
	СтруктураДействий.Вставить("ПоказыватьКолонкуКоличествоВДокументе", Истина);
	СтруктураДействий.Вставить("УстановитьРежимПечатиИзДокумента");
	СтруктураДействий.Вставить("УстановитьРежим", "ПечатьЭтикеток");
	СтруктураДействий.Вставить("ЗаполнитьКоличествоЭтикетокПоДокументу");
	СтруктураДействий.Вставить("ЗаполнитьТаблицуТоваров");
	
	// Подготовка данных для заполенения табличной части обработки печати ценников и этикеток
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Товары", ТЗ);
	СтруктураРезультат.Вставить("СтруктураДействий", СтруктураДействий);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
	
КонецФункции
#КонецОбласти

#Область ФункцииРаботыСоЗвуком

&НаКлиенте
Процедура ПроигратьЗвук()
	
	Попытка
		ДанныеЗвука= ПолучитьМакет();
		ИмяВременногоФайла = КаталогВременныхФайлов() + "failTovar" + ".wav";
		ДанныеЗвука.Записать(ИмяВременногоФайла);		
		oVoice = Новый COMObject("SAPI.SpVoice");
		oSpFileStream = Новый COMObject("SAPI.SpFileStream");
		oSpFileStream.Open(ИмяВременногоФайла);
		oVoice.SpeakStream(oSpFileStream);
		oSpFileStream.Close();
	Исключение
		Сообщить("Ошибка: "+ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакет()
	
	ДанныеЗвука = ПолучитьОбщийМакет("Док_Макет_ТоварНеНайден");
	Возврат ДанныеЗвука;
	
КонецФункции

&НаКлиенте
Процедура Док_ТоварыПриАктивизацииСтрокиПосле(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если Не (ТекущиеДанные = Неопределено) И (ТекущиеДанные.КоличествоУпаковок = 0) И (ТекущиеДанные.КоличествоУпаковокФакт > 0) Тогда
		ПроигратьЗвук();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено И Поле.Имя = "Номенклатура" Тогда
      ОткрытьЗначение(Элемент.ТекущиеДанные.Номенклатура);   
	КонецЕсли;
  
КонецПроцедуры

&НаКлиенте
Процедура Док_ПоискПоШтрихкодуПосле(Команда)
	//Альтерра +
	Если ВремяНачалаПриемки = '00010101' Тогда
		ВремяНачалаПриемки = ТекущаяДата();
	КонецЕсли;
	//Альтерра +
КонецПроцедуры

&НаСервере
&Вместо("ПоискПоШтрихкодуЗавершениеНаСервере")
Процедура Док_ПоискПоШтрихкодуЗавершениеНаСервере(ДополнительныеПараметры)
	
	СобытияФорм.ПриИзмененииЭлемента(ЭтотОбъект, "ОбработатьДанныеШтрихкода", ДополнительныеПараметры);
	ПослеОбработкиШтрихкодов(ДополнительныеПараметры);
	ДополнительныеПараметры.РезультатОбработкиШтрихкода.ДобавленныеСтроки = Новый Массив;
	ДополнительныеПараметры.РезультатОбработкиШтрихкода.ИзмененныеСтроки  = Новый Массив;
	//Альтерра +
	Если ВремяНачалаПриемки = '00010101' Тогда
		ВремяНачалаПриемки = ТекущаяДата();
	КонецЕсли;
	//Альтерра +
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыКоличествоУпаковокФактПриИзмененииПосле(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;	
	ТекущиеДанные.СпособВводаКоличества = ПредопределенноеЗначение("Перечисление.СпособыВводаКоличестваТовара.Клавиатура");	
	
	Если ВремяНачалаПриемки = '00010101' Тогда
		ВремяНачалаПриемки = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыПриИзмененииПосле(Элемент)
	
	Если ВремяНачалаПриемки = '00010101' Тогда
		ВремяНачалаПриемки = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбменТабличнойЧастиТоварыСХранилищемНастроек
&НаКлиенте
Процедура Док_СохранитьТЧПосле(Команда)
	СохранитьТЧВХранилищеНастроекКлиент();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТЧВХранилищеНастроекКлиент()
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаПроверка" Тогда
		СохранитьТЧВХранилищеНастроек();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТЧВХранилищеНастроек()
	
	КлючОбъекта = ТипЗнч(Ссылка);
	КлючНастроек = Ссылка.УникальныйИдентификатор();
	ДанныеТовары = Товары.Выгрузить();
	ИмяПользователя = ИмяПользователя();
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, ДанныеТовары, , ИмяПользователя);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТЧИзХранилищаНастроек()
	
	Попытка
		КлючОбъекта  = ТипЗнч(Ссылка);
		КлючНастроек = Ссылка.УникальныйИдентификатор();
		ИмяПользователя = ИмяПользователя();
		СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,КлючНастроек, ,ИмяПользователя);
		ЭтотОбъект.Товары.Загрузить(СтруктураНастроек);
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ("Для " + ИмяПользователя + ",нет сохраненных файлов в документе " + Ссылка);
		Сообщение.Сообщить();
		
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура Док_ЗагрузитьТЧПосле(Команда)
	ЗагрузитьТЧИзХранилищаНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВключитьТаймерСохраненияТЧ()
	
	Интервал = 20;
	ПодключитьОбработчикОжидания("СохранитьТЧВХранилищеНастроекКлиент", Интервал);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьТаймерСохраненияТЧ()
	ОтключитьОбработчикОжидания("СохранитьТЧВХранилищеНастроекКлиент");
КонецПроцедуры

&НаСервере
Процедура УдалитьТЧВХранилищеНастроек()
	
	КлючОбъекта  = ТипЗнч(Ссылка);
	ИмяПользователя = ИмяПользователя();
	ХранилищеОбщихНастроек.Удалить(КлючОбъекта,, ИмяПользователя);
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Элементы.ГруппаТорговоеОборудование.ПодчиненныеЭлементы.СохранитьЗагрузить.Видимость = Истина;
		ВключитьТаймерСохраненияТЧ(); 
		ПроверкаПеремещения = Истина;
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти
